import { useState } from "react";
import Footer from "../components/Footer";
import NavBar from "../components/NavBar";
import styles from "../assests/css/pagecss/InstructionsPage.module.css";
import { Link } from "react-router-dom";
import GoToTopButton from "../components/GoToTopButton";

export default function InstructionsPage() {
  const [selected, setSelecked] = useState(false);
  const data = [
    {
      title: "জীবনসাথীতে কিভাবে একাউন্ট তৈরি করবো?",
      content: (
        <div>
          ১) প্রথমে jibonsathi.org এ প্রবেশ করুন এবং হোম পেজের উপরের ডান কোণে
          থাকা ইউজার আইকনে ক্লিক করুন।
          <br />
          <br />
          ২) Create Account এ ক্লিক করুন।
          <br /> <br />
          ৩) রেজিস্ট্রেশন ফর্ম প্রদর্শিত হবে। আপনার নাম লিখুন এবং জেন্ডার
          সিলেক্ট করুন।
          <br /> <br />
          ৪) আপনার ইমেইল লিখে Verify বাটনে ক্লিক করুন। আপনার ইমেইল সঠিক হলে
          সেখানে একটি ভেরিফিকেশন কোড যাবে। নির্ধারিত স্থানে ভেরিফিকেশন কোড
          প্রবেশ করিয়ে Confirm বাটনে ক্লিক করে ইমেইল ভেরিফিকেশন সম্পন্ন করুন।
          <br /> <br />
          ৫) একটি পাসওয়ার্ড নির্বাচন করুন।
          <br /> <br />
          ৬) জীবনসাথীর <Link to={"/terms"}>Terms and Condition</Link> এবং{" "}
          <Link to={"/privacy"}>Privacy Policy</Link> এর সাথে একমত হলে চেকবক্স
          চেক করুন। <br />
          <br />
          ৭) Register বাটনে ক্লিক করে অ্যাকাউন্ট তৈরি সম্পন্ন করুন।
        </div>
      ),
    },
    {
      title: "জীবনসাথীতে কিভাবে বায়োডাটা জমা দিবো?",
      content: (
        <div>
          ১. প্রথমে জীবনসাথীতে লগইন করুন। জীবনসাথীতে অ্যাকাউন্ট না থাকলে
          অ্যাকাউন্ট তৈরি করুন।
          <br />
          <br /> ২. লগইন করার পর হোম পেজ বা ড্যাশবোর্ড থেকে বায়োডাটা তৈরি করুন
          বাটনে ক্লিক করুন। <br />
          <br />
          ৩. বায়োডাটা তৈরির পূর্বে জীবনসাথীর শর্ত সমূহ পড়ুন এবং সম্মত হলে
          চেকবক্স চেক করে বায়োডাটা তৈরি করুন বাটনে ক্লিক করুন। <br />
          <br />
          ৪. বায়োডাটা ফর্ম প্রদর্শিত হবে। ফর্মে সকল তথ্য সঠিকভাবে দেয়া শেষ হলে
          বায়োডাটা রিভিউ পেজে প্রবেশ করবেন এবং সব তথ্য ভালভাবে পরিদর্শন করে
          Submit বাটনে ক্লিক করে বায়োডাটা জমা দিন। <br />
          <br />
          ৫. কয়েকদিনের মাঝে জীবনসাথী কাস্টমার কেয়ার থেকে আপনার অভিভাবক এবং
          আপনাকে কল করে ভেরিফাই করা হবে।
          <br />
          <br />
          ৬. জীবনসাথী কাস্টমার কেয়ার কর্তৃক আপনার বায়োডাটা রিভিউ শেষে একটি মেইল
          দিয়ে এপ্রুভ অথবা নট-এপ্রুভ স্ট্যাটাস জানানো হবে ইন শা আল্লাহ । <br />
          <br />
          <br />{" "}
          <strong> বি. দ্রঃ বায়াডাটায় সকল তথ্য স্পষ্ট করে লিখবেন।</strong>
        </div>
      ),
    },
    {
      title: "জীবনসাথীতে বায়োডাটা এডিট করবো কিভাবে?",
      content: (
        <div>
          ১. প্রথমে জীবনসাথীতে একাউন্টে লগইন করুন।
          <br />
          <br />
          ২. লগইন করার উপরের ডান কোণে থাকা ইউজার আইকনে ক্লিক করুন।
          <br />
          <br />
          ৩. বায়োডাটা এডিট করুন বাটনে ক্লিক করুন।
          <br />
          <br />
          ৪. বায়োডাটা ফর্মটি প্রদর্শিত হবে, আপনি যে তথ্যটি এডিট করতে চান সেখানে
          প্রবেশ করে এডিট শেষে বায়োডাটা রিভিউ করুন এবং Submit বাটনে ক্লিক করুন।
          <br />
          <br />
          ৫. জীবনসাথী কাস্টমার কেয়ার থেকে আপনার এডিট করা তথ্য রিভিউ করা হবে।
          <br />
          <br />
          ৬. রিভিউ শেষে একটি মেইল দিয়ে এপ্রুভ অথবা নট-এপ্রুভ স্ট্যাটাস জানানো
          হবে ইন শা আল্লাহ।
        </div>
      ),
    },
    {
      title: "জীবনসাথীতে বায়োডাটা সাময়িক সময়ের জন্য হাইড করবো কিভাবে?",
      content: (
        <div>
          <b>
            পাত্র/পাত্রী পক্ষের সাথে বিয়ের কথা চলা অবস্থায় আপনার বায়োডাটা হাইড
            করে রাখুন।
          </b>{" "}
          এছাড়াও আপনি যে কোনো কারণে যে কোনো সময়কালের জন্য এক ক্লিকে বায়োডাটা
          হাইড করে রাখতে পারবেন। অর্থাৎ আপনার বায়োডাটা সার্চ রেজাল্টে দেখানো হবে
          না।
          <br />
          <br />
          <br />
          ১. প্রথমে জীবনসাথী একাউন্টে লগইন করুন।
          <br />
          <br />
          ২. লগইন করার পর ড্যাশবোর্ডে যান অথবা উপরের ডান কোণে থাকা ইউজার আইকনে
          ক্লিক করুন।
          <br />
          <br />
          ৩. Biodata Status এর নিচে স্লাইড বাটনে ক্লিক করুন।
          <br />
          <br />
          ৪. আপনাকে একটি কনফার্মেশন পপআপ দেখাবে।
          <br />
          <br />
          ৫. Ok বাটনে ক্লিক করে বায়োডাটা হাইড করুন। <br />
          <br />
          <br />
          একই উপায়ে আবার যে কোনো সময় বায়োডাটা লাইভ করতে পারবেন। তবে কোন তথ্য
          এডিট করা হলে কাস্টমার কেয়ার আপনার বায়োডাটা আবার রিভিউ করবে।
        </div>
      ),
    },
    {
      title: "জীবনসাথীতে বায়োডাটা ডিলিট করবো কিভাবে?",
      content: (
        <div>
          আপনি যে কোনো সময় আপনার বায়োডাটা নিজেই ডিলিট করতে পারবেন।
          <br />
          <br />
          <br />
          ১. প্রথমে জীবনসাথী একাউন্টে লগইন করুন।
          <br />
          <br />
          ২. লগইন করার পর ড্যাশবোর্ডে যান অথবা উপরের ডান কোণে থাকা ইউজার আইকনে
          ক্লিক করুন।
          <br />
          <br />
          ৩. সেটিংস এ ক্লিক করুন।
          <br />
          <br />
          ৪. বায়োডাটা ডিলিট বাটনে ক্লিক করে ডিলিট সম্পন্ন করুন। <br />
          <br />
          <br />
          <b>বি. দ্রঃ</b> আপনার বায়োডাটা একবার ডিলিট করলে আর ফেরত আনতে পারবেন
          না। সাময়িক সময়ের জন্য প্রয়োজন হলে হাইড করে রাখতে পারেন।
        </div>
      ),
    },
    {
      title: "কোনো বায়োডাটার ব্যাপারে অভিযোগ করবো কিভাবে?",
      content: (
        <div>
          আপনি পয়েন্ট ব্যবহারের মাধ্যমে কোনো বায়োডাটার যোগাযোগ তথ্য দেখে থাকলে,
          সেই বায়োডাটার ব্যাপারে কোনো অভিযোগ করতে চাইলে-
          <br />
          <br />
          <br />
          ১. উক্ত বায়োডাটার নিচে Report বাটনে ক্লিক করুন। অথবা ড্যাশবোর্ড থেকে
          আমার দেখা সমূহ মেনুতে যান। সেখান থেকে অভিযুক্ত বায়োডাটার পাশের Report
          বাটনে ক্লিক করুন।
          <br />
          <br />
          ২. নির্ধারিত ফর্ম পূরণ করে আপনার অভিযোগ করুন।
          <br />
          <br />
          কাস্টমার কেয়ার থেকে তা যাচাই করে উপযুক্ত পদক্ষেপ নেয়া হবে ইন শা
          আল্লাহ।
        </div>
      ),
    },
    {
      title: "কিভাবে পয়েন্ট রিচার্জ করবো?",
      content: (
        <div>
          একজন পাত্র বা পাত্রীর অভিভাবকের যোগাযোগের নাম্বার দেখতে একটি পয়েন্ট
          ব্যবহার করতে হয়। নিম্নবর্ণিত উপায়ে পয়েন্ট রিচার্জ করতে পারবেন- <br />
          <br />
          <br />
          ১. প্রথমে জীবনসাথী ড্যাসবোর্ডে প্রবেশ করুন। <br />
          <br />
          ২. 'ফ্রি পয়েন্ট রিচার্জ করুন' বাটনটিতে ক্লিক করুন। <br />
          <br />
          ৩. এই পেজে ৩ টি কানেকশন প্যাকেজ দেখতে পাবেন। আপনার প্রয়োজন অনুযায়ী
          একটি প্যাকেজ নির্বাচন করুন এবং Recharge বাটনটিতে ক্লিক করুন। <br />
          <br />
          ৪. এডমিন এপ্রুভ করার পর ড্যাসবোর্ডে এসে আপনার কানেকশন দেখতে পারবেন এবং
          অভিভাবকের নাম্বার পেতে এটি ব্যবহার করতে পারবেন।
        </div>
      ),
    },
  ];

  // const data = Data.slice(0, 18);
  const toggle = (index) => {
    if (selected === index) {
      setSelecked(null);
    } else {
      setSelecked(index);
    }
  };

  const Mystyles = {
    backgroundColor: "white",
    padding: "25px",
    textAlign: "center",
    fontSize: "32px",
  };

  return (
    <>
      <NavBar />
      <h2 style={Mystyles}>সাধারণ নির্দেশিকা</h2>

      {/* First Instruction  */}
      <div className={styles.instructionsContainer}>
        <div className={styles.instructionsWrapper}>
          {data.map((data, index) => (
            <div key={index} className={styles.instructions}>
              <div
                onClick={() => toggle(index)}
                className={styles.instructionsTitle}
              >
                <h3>{data.title}</h3>
                <span>{selected === index ? "-" : "+"}</span>
              </div>
              <div
                className={
                  selected === index
                    ? `${styles.instructionsDescriptionWrapper} ${styles.show}`
                    : styles.instructionsDescriptionWrapper
                }
              >
                <div className={styles.instructionsDescription}>
                  {data.content}
                </div>
              </div>
            </div>
          ))}
        </div>
      </div>
      <GoToTopButton/>
      <Footer />
    </>
  );
}
